yiqing001/ESP32-C3/sdkconfig.defaults
# Default target (new projects only; does not overwrite existing sdkconfig)
CONFIG_IDF_TARGET="esp32c3"

# OTA dual app partitions (partitions.csv)
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# HTTP OTA (esp_http_server enabled via main/CMakeLists.txt)
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Longer WDT for OTA flash writes
CONFIG_ESP_INT_WDT_TIMEOUT_MS=1000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# mDNS
CONFIG_MDNS_MAX_SERVICES=4

# WiFi: set SSID/password in menuconfig or local sdkconfig (not in git)
CONFIG_OTA_WIFI_SSID=""
CONFIG_OTA_WIFI_PASSWORD=""
CONFIG_OTA_DEVICE_NAME_PREFIX="MaiQing-C3"
CONFIG_OTA_HTTP_PORT=80

# Joystick test off by default; enable in menuconfig when needed
# CONFIG_JOYSTICK_ENABLE_TEST is not set
